/* Привітання за часом

Залежно від часу доби, виведіть привітання: "Доброго ранку!", "Доброго дня!" або "Доброго вечора!".
Вхід: Година (наприклад, 15)
Вихід:
Якщо год < 12: "Доброго ранку!"
Якщо год 12–18: "Доброго дня!"
Якщо год > 18: "Доброго вечора!" */

export function greeting(hourValue: number): string {
  if (hourValue == 0 || hourValue > 23) {
    return ("Невірне значення години. Має бути в діапазоні від 0 до 23.");
  }

  if (hourValue < 12) {
    return "Доброго ранку!";
  } else if (hourValue >= 12 && hourValue < 18) {
    return "Доброго дня!";
  } else {
    return "Доброго вечора!";
  }
}